Autodesk.Revit.DB.AddInId.GetAddInName
name of addin associated with this AddInId
Attempts to obtain the name from loaded Third Party AddIns
Returns:
name of addin
Since:
2011

Autodesk.Revit.DB.AddInId.GetGUID
value of the AddInId as a GUID
Returns:
GUID value of the AddInId
Since:
2011

Autodesk.Revit.DB.AddInId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AddInId.GetAddInNameFromDocument(Autodesk.Revit.DB.Document)
name of application associated with this ApplicationId
First attempts to obtain the name from AddInIds stored in the document.
If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
aDoc:
target document
Returns:
name of application
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.AddInId.#ctor(System.Guid)
creates an AddInId object with a given GUID
val:
GUID value
Since:
2011

Autodesk.Revit.DB.AddInId
Identifies an AddIn registered with Revit
Since:
2011